---
kind: method
id: M:Autodesk.Revit.DB.Lighting.InitialIntensity.Dispose
source: html/199fd5c6-4446-00a0-7b9d-2f8b9d080683.htm
---
# Autodesk.Revit.DB.Lighting.InitialIntensity.Dispose Method

Releases all resources used by the InitialIntensity

## Syntax (C#)
```csharp
public void Dispose()
```